app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT  "posts".* FROM "posts"  ORDER BY "posts"."id" ASC LIMIT 1

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "This is becoming a  rails app. Really cool, ain't it. Thank you Jesus"], ["created_at", "2015-01-25 02:03:35.947733"], ["title", "MIGHT"], ["updated_at", "2015-01-25 02:03:35.947733"]]